---
kind: type
id: T:Autodesk.Revit.DB.DefaultDivideSettings
source: html/c4d57a70-3192-458c-faa7-619d11c69f60.htm
---
# Autodesk.Revit.DB.DefaultDivideSettings

Provides access to project-wide divide settings.

## Syntax (C#)
```csharp
public class DefaultDivideSettings : Element
```